settings.org
#+setupfile: "~/.emacs.d/public/blog/setup-it.org"

#+LANGUAGE: ru
#+PROPERTY: results silent

* DONE Мой конфиг Emacs в формате org-mode                            :emacs:
  :PROPERTIES:
  :EXPORT_FILE_NAME: my-emacs-config
  :END:

** Описание

 Этот конфиг использую на всех десктопах и телефонах. Постепенно он пополняется. Актуальную версию всегда можно найти в рабочем репозитории:
 [[https://github.com/johnlepikhin/emacs-public/blob/master/settings.org]].

 Из него динамически подгружаются файлы:
  * ~/.emacs.d/local/user-info.org : настройки email, имени пользователя и т.д.
  * ~/.emacs.d/local/org-agenda.org : личные настройки шаблонов agenda
  * ~/.emacs.d/local/org-capture.org : личные шаблоны org-записей
  * ~/.emacs.d/local/gnus-accounts.org : почтовые аккаунты
  * ~/.emacs.d/local/gnus-templates.org : почтовые шаблоны

*** Как подключать

 В ~/.emacs надо написать:

 #+BEGIN_EXAMPLE
 (package-initialize)

 (defun my-load-org-config (subpath)
   (let ((ini-file (expand-file-name subpath user-emacs-directory)))
	 (condition-case errinfo (org-babel-load-file ini-file)
	   (error (message "Cannot load settings for file %s: %s" ini-file errinfo)))))

 (my-load-org-config "public/settings.org")
 #+END_EXAMPLE

 Здесь public/settings.org будет транслировано в ~/.emacs.d/public/settings.org, согласно значению user-emacs-directory.

** Базовая конфигурация

 Все переменные здесь лексически локальны:

 #+BEGIN_SRC emacs-lisp
 (setq-local lexical-binding t)
 #+END_SRC

 Собрать информацию по use-package. После загрузки можно позвать функци use-package-report и посмотреть.

 #+BEGIN_SRC emacs-lisp
 (setq use-package-compute-statistics t)
 #+END_SRC

*** Внешний вид

 Некоторые оптимизации:

 #+BEGIN_SRC emacs-lisp
   (setq auto-revert-interval 1            ; Refresh buffers fast
         custom-file (make-temp-file "")   ; Discard customization's
         default-input-method "TeX"        ; Use TeX when toggling input method
         echo-keystrokes 0.1               ; Show keystrokes asap
         inhibit-startup-message t         ; No splash screen please
         initial-scratch-message nil       ; Clean scratch buffer
         sentence-end-double-space nil)    ; No double space
 #+END_SRC

 Выключить кнопку Insert (включение overwrite-mode):

 #+BEGIN_SRC emacs-lisp
 (define-key global-map [(insert)] nil)
 #+END_SRC

 Выключить тулбар:

 #+BEGIN_SRC emacs-lisp
 (tool-bar-mode -1)
 #+END_SRC

 Ширина заполнения по умолчанию большая, сейчас широкие мониторы:

 #+BEGIN_SRC emacs-lisp
 (setq-default fill-column 140)
 #+END_SRC

 Не надо мне сообщать, что у строки есть продолжение. Просто показывай продолжение на
 следующей строке:

 #+BEGIN_SRC emacs-lisp
 (setq-default truncate-lines t)
 #+END_SRC

*** Настройка темы

 #+BEGIN_SRC emacs-lisp
   (load-theme 'leuven t)
 #+END_SRC

*** Менеджер пакетов и зависимостей

 Подключить менеджер пакетов:

 #+BEGIN_SRC emacs-lisp
 (require 'package)

 (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
 (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/"))
 (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
 #+END_SRC

 Прибить гвоздями указанные пакеты к репозиториям:

 #+BEGIN_SRC emacs-lisp
 (add-to-list 'package-pinned-packages '(cider . "melpa-stable") t)
 #+END_SRC

 Поставить перечисленные пакеты, если не установлены:

 #+BEGIN_SRC emacs-lisp
 (dolist (package
          '(use-package))
   (if (not (package-installed-p package))
     (progn
       (message "Installing package %s" package)
     (package-refresh-contents)
       (package-install package))))
 #+END_SRC

 Настраиваем use-package:

 #+BEGIN_SRC emacs-lisp
 (require 'use-package)
 (setq use-package-always-ensure t)
 #+END_SRC

 Больше дебага для use-package:

 #+BEGIN_SRC emacs-lisp
 (setq use-package-verbose t)
 #+END_SRC

 Я хочу указывать зависимости к системным пакетам при использовании use-package:

 #+BEGIN_SRC emacs-lisp
 (use-package use-package-ensure-system-package
   :ensure t)
 #+END_SRC

 Продублируем определение, подгружающее функции из ~/.emacs:

 #+BEGIN_SRC emacs-lisp
 (defun my-load-org-config (subpath)
   (let ((ini-file (expand-file-name subpath user-emacs-directory)))
	 (condition-case errinfo
		 (progn
		   (org-babel-load-file ini-file)
		   (message "Loaded config: %s" subpath))
	   (error (message "Cannot load settings for file %s: %s" ini-file errinfo)))))
 #+END_SRC

*** Информация о пользователе

 #+BEGIN_SRC emacs-lisp
 (my-load-org-config "local/user-info.org")
 #+END_SRC

** Настройки ввода

 У меня переключение раскладки внутри Emacs интегрировано с XMonad. Нижеследующие функции служат этой интеграции.

 #+BEGIN_SRC emacs-lisp
 (defun my-update-cursor ()
   (set-cursor-color
    (if (string= current-input-method "russian-computer") "red" "black")))

 (add-hook 'buffer-list-update-hook 'my-update-cursor)

 (defun my-update-isearch-input-method ()
   (if isearch-mode
       (progn
         (setq isearch-input-method-function input-method-function
               isearch-input-method-local-p t)
         (isearch-update))))

 (defun my-update-input-method (is-ru)
   (if is-ru
       (set-input-method 'russian-computer)
     (inactivate-input-method))
   (my-update-isearch-input-method)
   (my-update-cursor))

 (defun my-select-input-eng ()
   (interactive)
   (my-update-input-method nil))

 (defun my-select-input-rus ()
   (interactive)
   (my-update-input-method t))

 (global-set-key (kbd "<M-f11>") 'my-select-input-eng)
 (global-set-key (kbd "<M-f12>") 'my-select-input-rus)
 (define-key isearch-mode-map (kbd "<M-f11>") 'my-select-input-eng)
 (define-key isearch-mode-map (kbd "<M-f12>") 'my-select-input-rus)
 #+END_SRC

 Странный способ добавить ещё одну раскладку:

 #+BEGIN_SRC emacs-lisp
 (set-input-method 'russian-computer)
 (toggle-input-method)
 #+END_SRC

 Создаем личную карту аккордов:

 #+BEGIN_SRC emacs-lisp
 (defvar my-bindings-map (make-keymap)
   "Мои личные горячие клавиги.")

 (define-minor-mode my-bindings-mode
   "Режим для подключения моих кнопок."
   t nil my-bindings-map)

 (define-key my-bindings-map (kbd "C-c <up>")    'windmove-up)
 (define-key my-bindings-map (kbd "C-c <down>")  'windmove-down)
 (define-key my-bindings-map (kbd "C-c <left>")  'windmove-left)
 (define-key my-bindings-map (kbd "C-c <right>") 'windmove-right)
 (define-key my-bindings-map [C-return] (lambda () (interactive) (point-to-register 'r)))
 (define-key my-bindings-map [M-return] (lambda () (interactive) (jump-to-register 'r)))
 #+END_SRC

 Зачем мне замораживать фреймы?

 #+BEGIN_SRC emacs-lisp
 (global-unset-key (kbd "C-z"))
 #+END_SRC

*** Expand region

 По нажатию ~C-=~ выбранный регион семантически/синтаксически расширяется:

 #+BEGIN_SRC emacs-lisp
 (use-package
   expand-region
   :bind (:map my-bindings-map
               ("C-=" . er/expand-region)))
 #+END_SRC

** Внешний вид

Золотое сечение для расположения окон:

 #+BEGIN_SRC emacs-lisp
 (use-package zoom
   :commands zoom-mode
   :config
   (setq zoom-ignored-major-modes '(gnus-summary-mode))
   (setq zoom-size '(0.618 . 0.618)))
 (zoom-mode t)
 #+END_SRC

Удобное хождение по окнам:

#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :defer t
  :bind (:map my-bindings-map
              ("M-o" . ace-window)))
#+END_SRC

Подсказка по вводимым кнопкам. Отображать с задержкой в 1 секунду:

 #+BEGIN_SRC emacs-lisp
 (use-package
   which-key
   :config 
   (setq which-key-idle-delay 1)
   (which-key-mode))
 #+END_SRC

Показывать в минибуфере позицию в строке:

 #+BEGIN_SRC emacs-lisp
 (column-number-mode)
 #+END_SRC

*** Imenu

#+BEGIN_SRC emacs-lisp
(use-package
  imenu
  :bind (:map my-bindings-map
              ("M-'" . imenu-list-smart-toggle)))
#+END_SRC


*** Выключить menu-bar, показывать по F10

#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)

(defun my-toggle-menu-bar ()
  (interactive)
  (toggle-menu-bar-mode-from-frame 'toggle))

(define-key my-bindings-map (kbd "<f10>") 'my-toggle-menu-bar)
#+END_SRC


** Поведение

 Бэкапы не нужны:

 #+BEGIN_SRC emacs-lisp
 (setq backup-inhibited t)
 #+END_SRC

 Шаг отступа по умолчанию 4 символа:

 #+BEGIN_SRC emacs-lisp
 (setq-default tab-width 4) 
 (setq-default standart-indent 4)
 #+END_SRC

 Я люблю ограничивать область видимости до выбранного региона, не надо меня ворнить:

 #+BEGIN_SRC emacs-lisp
 (put 'narrow-to-region 'disabled nil)
 #+END_SRC

 История открытых файлов:

 #+BEGIN_SRC emacs-lisp
 (use-package
   recentf
   :config
   (setq recentf-max-saved-items 100)
   (setq recentf-max-menu-items 25)
   (recentf-mode 1))
 #+END_SRC

 Помнить позиции в файлах:

 #+BEGIN_SRC emacs-lisp
 (save-place-mode 1)
 #+END_SRC

 Поминить историю команд минибуфера:

 #+BEGIN_SRC emacs-lisp
 (savehist-mode 1)
 #+END_SRC

 Браузер по умолчанию — chromium:

 #+BEGIN_SRC emacs-lisp
 (setq browse-url-browser-function 'browse-url-chromium)
 #+END_SRC

Использовать ivy в качестве движка автодополнения имен буферов, файлов и т.д.

[2019-09-23 Mon] закомментил т.к. тормозит на больших файлах.

# #+BEGIN_SRC emacs-lisp
# (use-package ivy
#   :defer 0.1
#   :diminish
#   :bind (("C-c C-r" . ivy-resume)
#          ("C-x B" . ivy-switch-buffer-other-window))
#   :custom
#   (ivy-count-format "(%d/%d) ")
#   (ivy-use-virtual-buffers t)
#   :config (ivy-mode))

# (use-package counsel
#   :after ivy
#   :config (counsel-mode))
# #+END_SRC

Ищем swiper'ом:

[2019-09-23 Mon] закомментил т.к. тормозит на больших файлах.

# #+BEGIN_SRC emacs-lisp
# (use-package swiper
#   :after ivy
#   :bind (("C-s" . swiper)
#          ("C-r" . swiper)))
# #+END_SRC




*** Правильный список буферов

[2019-09-23 Mon] закомментил т.к. тормозит на больших файлах.

#     #+BEGIN_SRC emacs-lisp
# (use-package
#   ibuffer
#   :bind (:map my-bindings-map
#                ("C-x C-b" . ibuffer))
#   :hook ((ibuffer-mode . hl-line-mode)))
# #+END_SRC

*** Настройки isearch

 У меня плохо прижились стандартные кнопки, слегка переназначил:

 #+BEGIN_SRC emacs-lisp
 (define-key isearch-mode-map (kbd "<up>") 'isearch-ring-retreat )
 (define-key isearch-mode-map (kbd "<down>") 'isearch-ring-advance )

 (define-key isearch-mode-map (kbd "<left>") 'isearch-repeat-backward)
 (define-key isearch-mode-map (kbd "<right>") 'isearch-repeat-forward)

 (define-key minibuffer-local-isearch-map (kbd "<left>") 'isearch-reverse-exit-minibuffer)
 (define-key minibuffer-local-isearch-map (kbd "<right>") 'isearch-forward-exit-minibuffer)
 #+END_SRC

** Редактирование

 Многострочный режим комментариев по умолчанию

 #+BEGIN_SRC emacs-lisp
 (setq comment-style 'multi-line)
 #+END_SRC

 У нас не принято разделять предложения двойным пробелом:

 #+BEGIN_SRC emacs-lisp
 (setq sentence-end-double-space nil)
 #+END_SRC

 Мы презираем табулялцию в отступах:

 #+BEGIN_SRC emacs-lisp
 (setq-default indent-tabs-mode nil)
 #+END_SRC

