settings.el
(setq-local lexical-binding t)

(setq use-package-compute-statistics t)

(setq auto-revert-interval 1            ; Refresh buffers fast
      custom-file (make-temp-file "")   ; Discard customization's
      default-input-method "TeX"        ; Use TeX when toggling input method
      echo-keystrokes 0.1               ; Show keystrokes asap
      inhibit-startup-message t         ; No splash screen please
      initial-scratch-message nil       ; Clean scratch buffer
      sentence-end-double-space nil)    ; No double space

(define-key global-map [(insert)] nil)

(tool-bar-mode -1)

(setq-default fill-column 140)

(setq-default truncate-lines t)

(load-theme 'leuven t)

(require 'package)

(add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/"))
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/"))
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

(add-to-list 'package-pinned-packages '(cider . "melpa-stable") t)

(dolist (package
         '(use-package))
  (if (not (package-installed-p package))
    (progn
      (message "Installing package %s" package)
    (package-refresh-contents)
      (package-install package))))

(require 'use-package)
(setq use-package-always-ensure t)

(setq use-package-verbose t)

(use-package use-package-ensure-system-package
  :ensure t)

(defun my-load-org-config (subpath)
  (let ((ini-file (expand-file-name subpath user-emacs-directory)))
	(condition-case errinfo
		(progn
		  (org-babel-load-file ini-file)
		  (message "Loaded config: %s" subpath))
	  (error (message "Cannot load settings for file %s: %s" ini-file errinfo)))))

(my-load-org-config "local/user-info.org")

(defun my-update-cursor ()
  (set-cursor-color
   (if (string= current-input-method "russian-computer") "red" "black")))

(add-hook 'buffer-list-update-hook 'my-update-cursor)

(defun my-update-isearch-input-method ()
  (if isearch-mode
      (progn
        (setq isearch-input-method-function input-method-function
              isearch-input-method-local-p t)
        (isearch-update))))

(defun my-update-input-method (is-ru)
  (if is-ru
      (set-input-method 'russian-computer)
    (inactivate-input-method))
  (my-update-isearch-input-method)
  (my-update-cursor))

(defun my-select-input-eng ()
  (interactive)
  (my-update-input-method nil))

(defun my-select-input-rus ()
  (interactive)
  (my-update-input-method t))

(global-set-key (kbd "<M-f11>") 'my-select-input-eng)
(global-set-key (kbd "<M-f12>") 'my-select-input-rus)
(define-key isearch-mode-map (kbd "<M-f11>") 'my-select-input-eng)
(define-key isearch-mode-map (kbd "<M-f12>") 'my-select-input-rus)

(set-input-method 'russian-computer)
(toggle-input-method)

(defvar my-bindings-map (make-keymap)
  "Мои личные горячие клавиги.")

(define-minor-mode my-bindings-mode
  "Режим для подключения моих кнопок."
  t nil my-bindings-map)

(define-key my-bindings-map (kbd "C-c <up>")    'windmove-up)
(define-key my-bindings-map (kbd "C-c <down>")  'windmove-down)
(define-key my-bindings-map (kbd "C-c <left>")  'windmove-left)
(define-key my-bindings-map (kbd "C-c <right>") 'windmove-right)
(define-key my-bindings-map [C-return] (lambda () (interactive) (point-to-register 'r)))
(define-key my-bindings-map [M-return] (lambda () (interactive) (jump-to-register 'r)))

(global-unset-key (kbd "C-z"))

(use-package
  expand-region
  :bind (:map my-bindings-map
              ("C-=" . er/expand-region)))

(use-package 
  golden-ratio
  :config (golden-ratio-mode 1))

(use-package
  which-key
  :config 
  (setq which-key-idle-delay 1)
  (which-key-mode))

(column-number-mode)

(setq backup-inhibited t)

(setq-default tab-width 4) 
(setq-default standart-indent 4)

(put 'narrow-to-region 'disabled nil)

(use-package
  recentf
  :config
  (setq recentf-max-saved-items 100)
  (setq recentf-max-menu-items 25)
  (recentf-mode 1))

(save-place-mode 1)

(savehist-mode 1)

(setq browse-url-browser-function 'browse-url-chromium)

(define-key isearch-mode-map (kbd "<up>") 'isearch-ring-retreat )
(define-key isearch-mode-map (kbd "<down>") 'isearch-ring-advance )

(define-key isearch-mode-map (kbd "<left>") 'isearch-repeat-backward)
(define-key isearch-mode-map (kbd "<right>") 'isearch-repeat-forward)

(define-key minibuffer-local-isearch-map (kbd "<left>") 'isearch-reverse-exit-minibuffer)
(define-key minibuffer-local-isearch-map (kbd "<right>") 'isearch-forward-exit-minibuffer)

(defun comment-dwim-line-or-region ()
  "[Un]comment line or region"
  (interactive)
  (if mark-active
      (comment-dwim t)
    (progn
      (comment-line 1)
      (forward-line -1))))

(define-key my-bindings-map (kbd "C-;") 'comment-dwim-line-or-region)

(setq comment-style 'multi-line)

(setq sentence-end-double-space nil)

(setq-default indent-tabs-mode nil)
