settings.org
*** Yasnippet: разворачивание сниппетов

 #+BEGIN_SRC emacs-lisp
 (use-package yasnippet
   :bind 
   (:map my-bindings-map
         ("C-<tab>" . yas-expand))
   ;; я не люблю, когда по tab-у мне пытаются что-то развернуть
   (:map yas-minor-mode-map
         ("<tab>" . nil)
         ("TAB" . nil))
   :hook ((cperl-mode org-mode) . yas-minor-mode)
   :commands (yas-minor-mode)
   :after (yasnippet-classic-snippets)
   :config
   ;; подключить мой публичный репозиторий сниппетов
   (add-to-list 'yas-snippet-dirs (expand-file-name "~/.emacs.d/public/yasnippets"))
   ;; теперь надо всё перечитать
   (yas-reload-all))

 (use-package yasnippet-classic-snippets)
 #+END_SRC

*** Удаление без пополнения kill-ring

 Не люблю, когда удаляемые куски текста автоматом копируются в буфер обмена. Кусочки кода откуда-то спёр.

 #+BEGIN_SRC emacs-lisp
 (defun my-delete-word (arg)
   "Delete characters forward until encountering the end of a word.
 With argument, do this that many times.
 This command does not push text to `kill-ring'."
   (interactive "p")
   (delete-region
    (point)
    (progn
      (forward-word arg)
      (point))))

 (defun my-backward-delete-word (arg)
   "Delete characters backward until encountering the beginning of a word.
 With argument, do this that many times.
 This command does not push text to `kill-ring'."
   (interactive "p")
   (my-delete-word (- arg)))

 (define-key my-bindings-map (kbd "C-S-k") 'my-delete-line-backward)
 (define-key my-bindings-map (kbd "M-d") 'my-delete-word)
 (define-key my-bindings-map (kbd "<M-backspace>") 'my-backward-delete-word)
 (define-key my-bindings-map (kbd "<C-backspace>") 'my-backward-delete-word)
 #+END_SRC

*** Показывать отступы

Отключить режим для файлов больше 100K:

#+BEGIN_SRC emacs-lisp
(defun my-disable-indent-guide-mode-for-big-buffer ()
  (when (> (buffer-size) 100000)
    (progn
      (message "Buffer is too big, disable guided indent mode")
      (indent-guide-mode -1))))
#+END_SRC

 #+BEGIN_SRC emacs-lisp
 (use-package
   indent-guide
   :hook ((prog-mode . indent-guide-mode)
          (find-file . my-disable-indent-guide-mode-for-big-buffer))
   :config
   (setq indent-guide-char "|")
   (set-face-foreground 'indent-guide-face "darkgray"))
 #+END_SRC

*** Умные скобочки

 #+BEGIN_SRC emacs-lisp
 (use-package
   smartparens
   :config
   ;; Есть баг с electric-parens-mode с cperl, заплатка из https://github.com/syl20bnr/spacemacs/issues/480
   (with-eval-after-load 'cperl-mode
	 (add-hook 'smartparens-enabled-hook  (lambda () (define-key cperl-mode-map "{" nil)))
	 (add-hook 'smartparens-disabled-hook  (lambda () (define-key cperl-mode-map "{" 'cperl-electric-lbrace))))
   ;; Включаем глобально
   (smartparens-global-mode 1))
 #+END_SRC

 Подсвечивать парную скобку, переходы по ним:

 #+BEGIN_SRC emacs-lisp
 (show-paren-mode 1)
 (setq show-paren-delay 0)

 (defun match-paren (arg)
   "Go to the matching paren."
   (interactive "p")
   (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
         ((looking-at "\\s\)") (forward-char 1) (backward-list 1))
         (t (self-insert-command (or arg 1)))))

 (define-key my-bindings-map (kbd "C-`") 'match-paren)
 #+END_SRC

*** Дерево отмены

 #+BEGIN_SRC emacs-lisp
 (use-package
   undo-tree
   :bind (:map my-bindings-map
               ("C-x u" . undo-tree-visualize))
   :config (global-undo-tree-mode 1))
 #+END_SRC

*** Автодополнение

 #+BEGIN_SRC emacs-lisp
 (use-package
   company
   :hook (prog-mode . company-mode)
   :config
   ;; сначала ищем в gtags, а если не нашли — смотрим в abbrev
   (add-to-list 'company-backends '(company-gtags :with company-dabbrev))
   ;; по кнопке TAB происходит и дополнение, и выбор варианта
;;   (company-tng-configure-default)
   (setq company-idle-delay 0
         company-echo-delay 0
         company-dabbrev-downcase nil
         company-show-numbers t
         company-minimum-prefix-length 2
         company-selection-wrap-around t
         company-transformers '(company-sort-by-occurrence
                                company-sort-by-backend-importance)))
 #+END_SRC

**** Автодополнение с неточным совпадением

К сожалению, поддерживает не так много бэкендов company. Я использую только для lisp.

 #+BEGIN_SRC emacs-lisp
 (use-package company-flx
   :demand t
   :init
   (company-flx-mode +1))
 #+END_SRC

**** Документация в company

#+BEGIN_SRC emacs-lisp
(use-package company-quickhelp
  :ensure t
  :hook (global-company-mode . company-quickhelp-mode)
  :commands (company-quickhelp-mode)
  :defer t
  :init (add-hook 'global-company-mode-hook #'company-quickhelp-mode))
#+END_SRC


*** Tramp

 #+BEGIN_SRC emacs-lisp
 (use-package
   tramp
   :config (setq tramp-use-ssh-controlmaster-options nil))
 #+END_SRC

*** drug-staff

Таскаем выделенное или строчку по буферу

#+BEGIN_SRC emacs-lisp
(use-package drag-stuff
  :bind (:map my-bindings-map
              ("M-p" . drag-stuff-up)
              ("M-n" . drag-stuff-down)))
#+END_SRC


** Разработка
*** Управление проектами

 Подключаем projectile:

 #+BEGIN_SRC emacs-lisp
   (use-package
     projectile
     :bind (:map projectile-mode-map
                 ("C-c p" . 'projectile-command-map))
     :config (projectile-mode +1))
 #+END_SRC

 Подключаем helm к projectile

 #+BEGIN_SRC emacs-lisp
 (use-package
   helm-projectile
   :after (projectile helm)
   :config (helm-projectile-on))
 #+END_SRC

*** Сборки

#+BEGIN_SRC emacs-lisp
(use-package multi-compile
  :commands (multi-compile multi-compile-run)
  :init
  (setq multi-compile-alist
        '((go-mode . (
                      ("go-build" "go build -v"
                       (locate-dominating-file buffer-file-name ".git"))
                      ("go-build-and-run" "go build -v && echo 'build finish' && eval ./${PWD##*/}"
                       (multi-compile-locate-file-dir ".git"))))
          )))
#+END_SRC


*** Magit

 #+BEGIN_SRC emacs-lisp
 (use-package
   magit
   :bind (:map my-bindings-map
               ("C-x g" . magit-status)))
 #+END_SRC

*** Индекс по тэгам

 #+BEGIN_SRC emacs-lisp
 (use-package ggtags
   :hook (cperl-mode . ggtags-mode)
   :config
   (setq ggtags-sort-by-nearness nil
         ggtags-navigation-mode-lighter nil
         ggtags-mode-line-project-name nil
         ggtags-oversize-limit (* 30 1024 1024)))
 #+END_SRC

*** Flycheck

 #+BEGIN_SRC emacs-lisp
 (use-package
   flycheck
   :config
   (setq flycheck-idle-change-delay 5)
   ;; Багфиксы, согласно проблеме https://github.com/flycheck/flycheck/issues/1278:
   ;; в :preface нельзя определять т.к. :preface обрабатывается до загрузки модуля
   (advice-add
    'flycheck-process-send-buffer
    :override
    (lambda (process)
      (condition-case err
          (save-restriction
            (widen)
            (if flycheck-chunked-process-input
                (flycheck--process-send-buffer-contents-chunked process)
              (process-send-region process (point-min) (point-max)))
            (process-send-eof process))
        (error
         (let* ((checker (process-get process 'flycheck-checker))
                (type (flycheck-checker-get checker 'standard-input)))
           (when (or (not (eq type 'ignore-error)) (process-live-p process))
             (signal (car err) (cdr err))))))))
   (flycheck-define-checker perl
     "A Perl syntax checker using the Perl interpreter.

     See URL `https://www.perl.org'."
     :command ("perl" "-w" "-c"
               (option-list "-I" flycheck-perl-include-path)
               (option-list "-M" flycheck-perl-module-list concat))
     :standard-input ignore-error
     :error-patterns
     ((error line-start (minimal-match (message))
             " at - line " line
             (or "." (and ", " (zero-or-more not-newline))) line-end))
     :modes (perl-mode cperl-mode)
     :next-checkers (perl-perlcritic))
   (setq flycheck-global-modes '(not org-mode)
         flycheck-display-errors-function nil
         flycheck-display-errors-delay 0
         ;; Иногда приходится разгребать чуланы с граблями, надо видеть тысячи ошибок в файле
         flycheck-checker-error-threshold 10000)
   (global-flycheck-mode))
 #+END_SRC

 Показывать ошибки прямо на месте, под строкой:

 #+BEGIN_SRC emacs-lisp
 (use-package
   flycheck-inline
   :after (flycheck)
   :hook (flycheck-mode . flycheck-inline-mode))
 #+END_SRC

