settings.el

(use-package yasnippet
  :bind (:map my-bindings-map
              ("C-<tab>" . yas-expand))
  :hook (cperl-mode . yas-minor-mode)
  :commands (yas-minor-mode)
  :after (yasnippet-classic-snippets)
  :config
  (add-to-list 'yas-snippet-dirs (expand-file-name "~/.emacs.d/public/yasnippets"))
  (yas-reload-all))

(use-package yasnippet-classic-snippets)

(defun my-delete-word (arg)
  "Delete characters forward until encountering the end of a word.
With argument, do this that many times.
This command does not push text to `kill-ring'."
  (interactive "p")
  (delete-region
   (point)
   (progn
     (forward-word arg)
     (point))))

(defun my-backward-delete-word (arg)
  "Delete characters backward until encountering the beginning of a word.
With argument, do this that many times.
This command does not push text to `kill-ring'."
  (interactive "p")
  (my-delete-word (- arg)))

(define-key my-bindings-map (kbd "C-S-k") 'my-delete-line-backward)
(define-key my-bindings-map (kbd "M-d") 'my-delete-word)
(define-key my-bindings-map (kbd "<M-backspace>") 'my-backward-delete-word)
(define-key my-bindings-map (kbd "<C-backspace>") 'my-backward-delete-word)

(use-package
  indent-guide
  :config
  (setq indent-guide-char "|")
  (set-face-foreground 'indent-guide-face "darkgray")
  (indent-guide-global-mode 1))

(use-package
  smartparens
  :config
  ;; Есть баг с electric-parens-mode с cperl, заплатка из https://github.com/syl20bnr/spacemacs/issues/480
  (with-eval-after-load 'cperl-mode
	(add-hook 'smartparens-enabled-hook  (lambda () (define-key cperl-mode-map "{" nil)))
	(add-hook 'smartparens-disabled-hook  (lambda () (define-key cperl-mode-map "{" 'cperl-electric-lbrace))))
  ;; Включаем глобально
  (smartparens-global-mode 1))

(show-paren-mode 1)
(setq show-paren-delay 0)

(defun match-paren (arg)
  "Go to the matching paren."
  (interactive "p")
  (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
        ((looking-at "\\s\)") (forward-char 1) (backward-list 1))
        (t (self-insert-command (or arg 1)))))

(define-key my-bindings-map (kbd "C-`") 'match-paren)

(use-package
  undo-tree
  :bind (:map my-bindings-map
              ("C-x u" . undo-tree-visualize))
  :config (global-undo-tree-mode 1))

(setq company-idle-delay 0
      company-echo-delay 0
      company-dabbrev-downcase nil
      company-minimum-prefix-length 2
      company-selection-wrap-around t
      company-transformers '(company-sort-by-occurrence
                             company-sort-by-backend-importance))

(use-package
  tramp
  :config (setq tramp-use-ssh-controlmaster-options nil))

(use-package
  projectile
  :bind (:map projectile-mode-map
              ("C-c p" . 'projectile-command-map))
  :config (projectile-mode +1))

(use-package
  helm-projectile
  :after (projectile helm)
  :config (helm-projectile-on))

(use-package
  magit
  :bind (:map my-bindings-map
              ("C-x g" . magit-status)))

(use-package ggtags
  :hook (cperl-mode . ggtags-mode)
  :config
  (setq ggtags-sort-by-nearness nil
        ggtags-navigation-mode-lighter nil
        ggtags-mode-line-project-name nil
        ggtags-oversize-limit (* 30 1024 1024)))

(use-package
  flycheck
  :config
  ;; Багфиксы, согласно проблеме https://github.com/flycheck/flycheck/issues/1278:
  ;; в :preface нельзя определять т.к. :preface обрабатывается до загрузки модуля
  (defun flycheck-process-send-buffer (process)
	(condition-case err
		(save-restriction
		  (widen)
		  (if flycheck-chunked-process-input
			  (flycheck--process-send-buffer-contents-chunked process)
			(process-send-region process (point-min) (point-max)))
		  (process-send-eof process))
	  (error
	   (let* ((checker (process-get process 'flycheck-checker))
			  (type (flycheck-checker-get checker 'standard-input)))
		 (when (or (not (eq type 'ignore-error)) (process-live-p process))
		   (signal (car err) (cdr err)))))))
  (flycheck-define-checker perl
	"A Perl syntax checker using the Perl interpreter.

    See URL `https://www.perl.org'."
	:command ("perl" "-w" "-c"
			  (option-list "-I" flycheck-perl-include-path)
			  (option-list "-M" flycheck-perl-module-list concat))
	:standard-input ignore-error
	:error-patterns
	((error line-start (minimal-match (message))
			" at - line " line
			(or "." (and ", " (zero-or-more not-newline))) line-end))
	:modes (perl-mode cperl-mode)
	:next-checkers (perl-perlcritic))
  (setq flycheck-global-modes '(not org-mode)
        flycheck-display-errors-function nil
        flycheck-display-errors-delay 0
		;; Иногда приходится разгребать чуланы с граблями, надо видеть тысячи ошибок в файле
		flycheck-checker-error-threshold 10000)
  (global-flycheck-mode))

(use-package
  flycheck-inline
  :after (flycheck)
  :hook (flycheck-mode . flycheck-inline-mode))
