settings.org
*** Perl

 Таблица символьного просмотра:

 #+BEGIN_SRC emacs-lisp
 (defun my-cperl-init-prettify-symbols ()
   (setq prettify-symbols-alist
		 '(("<=" . ?≤)
		   ("&&" . ?∧)
		   ("||" . ?∨)
		   ("!=" . ?≠)
		   ("for" . ?∀)
		   ("foreach" . ?∀)
		   ("exists" . ?∃)
		   ("undef" . ?∅)
		   ("sub" . ?λ)
		   ("return" . ?⊢)
		   ("//" . ?⫽)
		   ("my" . ?≡)
		   ("delete" . ?❌)
		   ("defined" . ?❓)
		   ("!" . ?¬)
		   ("not" . ?¬)
		   ("join" . ?𝐉)
		   ("grep" . ?𝐆)
		   ("map" . ?𝐌)
		   ("sort" . ?𝐒)
		   (".." . ?⋰)
		   ("next" . ?↰)
		   ("last" . ?↴)
		   ("while" . ?⮍)
		   ("if" . ?⎧)
		   ("elsif" . ?⎨)
		   ("else" . ?⎩)
		   ("int" . ?ℤ)
		   ("keys" . ?𝐊)
		   ("ne" . ?≭)
		   ("eq" . ?≍)
		   ("->" . ?→)
		   ("=>" . ?⇒)
		   ("=~" .?≈)
		   ("!~" . ?≉)
		   ("$self" . ?◆)))
   (prettify-symbols-mode))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp
 (use-package
   cperl-mode
   :ensure-system-package perltidy
   :after (flycheck tramp)
   :bind (:map cperl-mode-map ())
   :mode ("\\.\\([pP][Llm]\\|al\\)\\'" . cperl-mode)
   :interpreter (("perl"     . cperl-mode)
                 ("perl5"    . cperl-mode)
                 ("miniperl" . cperl-mode))
   :config 
   ;; perl := cperl
   (defalias 'perl-mode 'cperl-mode)
   ;; C-h P будет показывать perldoc на слово под курсором
   (define-key 'help-command "P" 'cperl-perldoc-at-point)
   ;; я люблю smartparens. Извини, cperl-mode.
   (setq cperl-electric-parens nil)
   ;; Символьное отображение синтаксиса
   (add-hook 'cperl-mode-hook 'my-cperl-init-prettify-symbols)
   ;; Отступ равен 4, не выпендриваться!
   (setq cperl-indent-level 4
		 cperl-close-paren-offset -4
		 cperl-continued-statement-offset 4
		 cperl-indent-parens-as-block t
		 cperl-tab-always-indent t)
   ;; Красные хэши меня всегда раздражали
   (face-spec-set 'cperl-hash-face '((t :foreground "darkblue"))))
 #+END_SRC

**** Автодополнение для Perl через PerlySense

 #+BEGIN_SRC emacs-lisp
 (use-package
   company-plsense
   :hook (cperl-mode . company-mode))
 #+END_SRC

*** Ocaml

 #+BEGIN_SRC emacs-lisp
 (use-package tuareg)
 #+END_SRC

 #+BEGIN_SRC emacs-lisp
 (use-package merlin
   :init
   ;; merlin сам их не объявил в зависимости, небольшой костыль
   (use-package iedit)
   (use-package auto-complete)
   :after (tuareg iedit auto-complete)
   :hook ((tuareg-mode . merlin-mode)
          (tuareg-mode . company-mode))
   :config
   (require 'opam-user-setup "~/.emacs.d/opam-user-setup.el"))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp
 (use-package flycheck-ocaml
   :after (flycheck merlin)
   :config
   ;; ошибки от мерлина нам не нужны, ведь у нас есть flycheck
   (setq merlin-error-after-save nil)
   (flycheck-ocaml-setup))
 #+END_SRC

*** Coq

#+BEGIN_SRC emacs-lisp
(defun my-coq-mode-setup ()
  (company-coq-mode)
  (setq-local company-minimum-prefix-length 1)
  (setq coq-double-hit-enable t)
  (golden-ratio-mode -1)
  (auto-complete-mode -1))

(use-package proof-general
  :mode ("\\.v$" . coq-mode)
  :hook (coq-mode . my-coq-mode-setup))
#+END_SRC

*** Golang

#+BEGIN_SRC emacs-lisp
(defun my-go-mode-setup ()
  (yas-minor-mode)
  (flycheck-mode)
  (add-hook 'before-save-hook 'gofmt-before-save)
  (add-hook 'completion-at-point-functions 'go-complete-at-point)
  (go-guru-hl-identifier-mode)
  (go-eldoc-setup))
#+END_SRC


#+BEGIN_SRC emacs-lisp
(use-package go-mode
  :ensure t
  :mode ("\\.go\\'" . go-mode)
  :config
  (add-hook 'go-mode-hook 'my-go-mode-setup))
#+END_SRC

Документация

#+BEGIN_SRC emacs-lisp
(use-package go-eldoc
  :ensure t
  :commands (go-eldoc-setup))
#+END_SRC

Автодополнение

#+BEGIN_SRC emacs-lisp
(use-package company-go
  :defer t
  :init
  (with-eval-after-load 'company
    (add-to-list 'company-backends 'company-go)))
#+END_SRC

Рефакторинг

#+BEGIN_SRC emacs-lisp
(use-package go-rename
  :commands (go-rename))
#+END_SRC

Подсветка идентификаторов

#+BEGIN_SRC emacs-lisp
(use-package go-guru
  :commands (go-guru-hl-identifier-mode))
#+END_SRC

*** Rust

#+BEGIN_SRC emacs-lisp
(defun my-rust-compile-setup ()
  (set (make-local-variable 'compile-command)
       (if (locate-dominating-file (buffer-file-name) "Cargo.toml")
           "cargo run"
         (format "rustc %s && %s" (buffer-file-name)
                 (file-name-sans-extension (buffer-file-name))))))

(use-package rust-mode
  :after (flycheck tramp racer compile)
  :hook (rust-mode . my-rust-compile-setup)
  :mode ("\\.rs\\'" . rust-mode)
  :bind (:map rust-mode-map
              ("C-c i b" . rust-format-buffer))
  :config
  (add-hook 'rust-mode-hook (lambda () (add-hook 'before-save-hook 'rust-format-buffer nil 'local))))
  ;; (add-hook 'before-save-hook 'rust-format-buffer))
#+END_SRC

**** Автодополнение

#+BEGIN_SRC emacs-lisp
(use-package racer
  :hook (rust-mode . racer-activate)
  :config
  (setq racer-rust-src-path "~/.local/share/rust_src/src"))
#+END_SRC

**** Проверка синтаксиса на лету

#+BEGIN_SRC emacs-lisp
(use-package flycheck-rust
  :after (flycheck)
  :hook (flycheck-mode . flycheck-rust-setup))
#+END_SRC

*** Puppet

#+BEGIN_SRC emacs-lisp
(use-package puppet-mode
  :config
  (setq puppet-indent-level 2)
  (setq puppet-include-indent 2))
#+END_SRC

*** HTML

 Подключаем web-mode (HTML, JS, CUSS в одном):

 #+BEGIN_SRC emacs-lisp
 (use-package web-mode
   :mode ("\\.html$" . web-mode)
   :init
   (setq web-mode-markup-indent-offset 4)
   (setq web-mode-code-indent-offset 4)
   (setq web-mode-css-indent-offset 4)
   (setq js-indent-level 4)
   (setq web-mode-enable-auto-pairing t)
   (setq web-mode-enable-auto-expanding t)
   (setq web-mode-enable-css-colorization t))
 #+END_SRC

*** Javascript / ECMA / React

#+BEGIN_SRC emacs-lisp
(use-package tide
  :after (company flycheck)
  :config
  (add-to-list 'company-backends 'company-tide)
  (add-hook 'tide-mode-hook (lambda () (add-hook 'before-save-hook 'tide-format-before-save nil 'local)))
  ;; (add-hook 'before-save-hook 'tide-format-before-save)
  (define-key tide-mode-map (kbd "C-.") 'tide-jump-to-definition)
  (define-key tide-mode-map (kbd "C-,") 'tide-jump-back)
  (flycheck-add-next-checker 'javascript-eslint 'javascript-tide 'append)
  (flycheck-add-next-checker 'javascript-eslint 'jsx-tide 'append)
  (tide-hl-identifier-mode +1))

  (defun my-jsx-setup ()
  (flycheck-mode +1))

(use-package rjsx-mode
  :mode ("\\.js" . rjsx-mode)
  :mode ("\\.jsx" . rjsx-mode)
  :hook (rjsx-mode . tide-setup)
  :hook (rjsx-mode . my-jsx-setup)
  :config
  (setq js-indent-level 2)
  (flycheck-add-mode 'javascript-eslint 'rjsx-mode))
#+END_SRC

*** SQL

#+BEGIN_SRC emacs-lisp
(use-package sql-indent
  :hook (sql-mode . sqlind-minor-mode)
  :commands sqlind-minor-mode)
#+END_SRC

