settings.el

(defun my-cperl-init-prettify-symbols ()
  (setq prettify-symbols-alist
		'(("<=" . ?≤)
		  ("&&" . ?∧)
		  ("||" . ?∨)
		  ("!=" . ?≠)
		  ("for" . ?∀)
		  ("foreach" . ?∀)
		  ("exists" . ?∃)
		  ("undef" . ?∅)
		  ("sub" . ?λ)
		  ("return" . ?⊢)
		  ("//" . ?⫽)
		  ("my" . ?≡)
		  ("delete" . ?❌)
		  ("defined" . ?❓)
		  ("!" . ?¬)
		  ("not" . ?¬)
		  ("join" . ?𝐉)
		  ("grep" . ?𝐆)
		  ("map" . ?𝐌)
		  ("sort" . ?𝐒)
		  (".." . ?⋰)
		  ("next" . ?↰)
		  ("last" . ?↴)
		  ("while" . ?↻)
		  ("if" . ?⑃)
		  ("else" . ?⊻)
		  ("int" . ?ℤ)
		  ("keys" . ?𝐊)
		  ("ne" . ?≭)
		  ("eq" . ?≍)
		  ("->" . ?→)
		  ("=>" . ?⇒)
		  ("=~" .?≈)
		  ("!~" . ?≉)
		  ("$self" . ?⋇)))
  (prettify-symbols-mode))

(use-package
  cperl-mode
  :ensure-system-package perltidy
  :after (flycheck tramp)
  :bind (:map cperl-mode-map ())
  :mode ("\\.\\([pP][Llm]\\|al\\)\\'" . cperl-mode)
  :interpreter (("perl"     . cperl-mode)
                ("perl5"    . cperl-mode)
                ("miniperl" . cperl-mode))
  :config 
  ;; perl := cperl
  (defalias 'perl-mode 'cperl-mode)
  ;; C-h P будет показывать perldoc на слово под курсором
  (define-key 'help-command "P" 'cperl-perldoc-at-point)
  ;; я люблю smartparens. Извини, cperl-mode.
  (setq cperl-electric-parens nil)
  ;; Символьное отображение синтаксиса
  (add-hook 'cperl-mode-hook 'my-cperl-init-prettify-symbols)
  ;; Отступ равен 4
  (setq cperl-indent-level 4)
  ;; Красные хэши меня всегда раздражали
  (face-spec-set 'cperl-hash-face '((t :foreground "darkblue"))))

(use-package
  company-plsense
  :after (cperl-mode)
  :hook (cperl-mode-hook . company-mode))

(use-package tuareg)

(use-package merlin
  :after (tuareg)
  :hook ((tuareg-mode . merlin-mode)
		 (tuareg-mode . company-mode)))

(use-package flycheck-ocaml
  :after (flycheck merlin)
  :config
  ;; ошибки от мерлина нам не нужны, ведь у нас есть flycheck
  (setq merlin-error-after-save nil)
  (flycheck-ocaml-setup))

(use-package web-mode
  :mode ("\\.html$" . web-mode)
  :init
  (setq web-mode-markup-indent-offset 4)
  (setq web-mode-code-indent-offset 4)
  (setq web-mode-css-indent-offset 4)
  (setq js-indent-level 4)
  (setq web-mode-enable-auto-pairing t)
  (setq web-mode-enable-auto-expanding t)
  (setq web-mode-enable-css-colorization t))
