settings.org
*** Форматирование

 Perltidy.el, взято отсюда: https://www.emacswiki.org/emacs/perltidy.el

 #+BEGIN_SRC emacs-lisp
 (defcustom perltidy-program "perltidy"
   "*Program name of perltidy"
   :type 'string
   :group 'perltidy)

 (defcustom perltidy-program-params
   '(;; I/O control
     "--standard-output"
     "--standard-error-output"
     "--force-read-binary"
     "--quiet"

     ;; FORMATTING OPTIONS
     "--no-check-syntax"
     )
   "*perltidy run options"
   :type 'list
   :group 'perltidy)

 (defcustom perltidy-rcregex "\\.perltidyrc"
   "perltidyrc file regex"
   :type 'string
   :group 'perltidy)

 (defun perltidy-buffer ()
   "Call perltidy for whole buffer."
   (interactive)
   (perltidy-region (point-min) (point-max)))
 ;;;###autoload
 (defun perltidy-region (beg end)
   "Tidy perl code in the region."
   (interactive "r")
   (or (get 'perltidy-program 'has-perltidy)
       (if (executable-find perltidy-program)
           (put 'perltidy-program 'has-perltidy t)
         (error "Seem perltidy is not installed")))
     (let ((old-perltidy-env (getenv "PERLTIDY"))
           (remote? (tramp-tramp-file-p buffer-file-name))
           (perltidyrc (perltidy-find-perltidyrc buffer-file-truename))
           (pertidyrc-remote (expand-file-name "perltidyrc-remote" temporary-file-directory))
           (perltidy-run-list perltidy-program-params)
           )

       (if (and (bound-and-true-p remote?)
                perltidyrc)
           (progn
             (require 'tramp-sh)
             (tramp-sh-handle-copy-file perltidyrc pertidyrc-remote t)
             (setq perltidyrc pertidyrc-remote)
             (setq perltidy-run-list
                   (append perltidy-run-list
                           (list (concat "-pro=" pertidyrc-remote))))))

       (apply #'call-process-region
              (append (list beg end perltidy-program
                            t
                            t
                            nil
                            )
                      perltidy-run-list)))
     t)

 (defun perltidy-subroutine ()
   "Call perltidy for subroutine at point."
   (interactive)

   (save-excursion
     (let ((current-point (point))
           b e)
       (setq b (progn (beginning-of-defun) (point)))
       (when (and
              (looking-at "\\s-*sub\\s-+")
              (< b current-point)
              (> (save-excursion
                   (setq e (progn (end-of-defun) (point))))
                 current-point))
         (perltidy-region b e)))))

 (defun perltidy-find-perltidyrc (&optional dir rcregex)
   (unless dir (setq dir (buffer-file-name)))
   (unless rcregex (setq rcregex perltidy-rcregex))
   (setq dir (file-name-directory dir))

   (let (rcfile)
     (catch 'my-tag
       (locate-dominating-file
        dir
        (lambda (parent)
          (let ((rc (car (ignore-errors (directory-files parent t rcregex))))
                (pparent (file-name-directory (directory-file-name parent))))
            (setq rcfile rc)
            (cond ((equal parent
                          pparent)
                   (if (= (length rc) 0)
                       (throw 'my-tag rc)
                     (throw 'my-tag nil)))

                  ((and (= (length rc) 0)
                        (file-exists-p    (expand-file-name "lib" pparent))
                        (file-directory-p (expand-file-name "lib" pparent)))
                   (setq rcfile (car (ignore-errors (directory-files pparent t rcregex))))
                   (throw 'my-tag rcfile))
                  (t rc))))))
     rcfile))
 #+END_SRC

 Perltidy для буфера, текущей функции, строчки и региона:

 #+BEGIN_SRC emacs-lisp
 (defun perl-mode-perltidy ()
   "Perltidy buffer or region if this is perl file."
   (interactive)
   (let ((saved-line (line-number-at-pos)))
     (save-excursion
       (when (eq major-mode 'cperl-mode)
         (if (use-region-p)
             (perltidy-region (region-beginning) (region-end))
           (perltidy-buffer))))
     (forward-line saved-line)))

 (defun my-perltidy-subroutine ()
   "Perltidy current subroutine keeping current position in the buffer as close as possible"
   (interactive)
   (let ((saved-line (line-number-at-pos)))
     (perltidy-subroutine)
     (goto-line saved-line)))

 (defun my-perl-tab-indent ()
   (interactive)
   (if (use-region-p)
       (perltidy-region (region-beginning) (region-end))
     (cperl-indent-command)))

 (use-package
   cperl-mode
   :after (tramp)
   :bind (:map cperl-mode-map
               ("C-c i d" . my-perltidy-subroutine)
               ("C-c i b" . perl-mode-perltidy)
               ("TAB" . my-perl-tab-indent)))
 #+END_SRC

 Вставка JSON из буфера как Perl-структуры. Не спрашивайте, нужно для работы.

 #+BEGIN_SRC emacs-lisp
 (defun my-perl-insert-json ()
   (interactive)
   (shell-command-on-region (point) (point) "xclip -o | json_to_perl.pl" t))

 (use-package
   cperl-mode
   :bind (:map cperl-mode-map
               ("C-c j" . my-perl-insert-json)))
 #+END_SRC

*** Подсветка TODO/FIXME

 #+BEGIN_SRC emacs-lisp
 (use-package fic-mode
   :hook cperl-mode emacs-lisp-mode)
 #+END_SRC

*** Цветной compile buffer

#+BEGIN_SRC emacs-lisp
(defun my-colorize-compilation-buffer ()
  (toggle-read-only)
  (ansi-color-apply-on-region compilation-filter-start (point))
  (toggle-read-only))

(use-package ansi-color
  :hook (compilation-filter . my-colorize-compilation-buffer))
#+END_SRC


** Org-mode
*** Основные настройки

 #+BEGIN_SRC emacs-lisp
 (defun my-org-mode-basic-config ()
   ;; По умолчанию таски длятся 1 час
   (setq org-agenda-default-appointment-duration 60)
   ;; SRC-блоки должны выглядеть максимально похоже на исходные режимы редактирования для этих языков
   (setq org-src-fontify-natively t)
   ;; Кнопка tab в SRC-блоках имеет то же поведение, что и в исходных режимах языков
   (setq org-src-tab-acts-natively t)
   ;; Не надо никуда смещать SRC-блоки
   (setq org-edit-src-content-indentation 0)
   ;; Ругаться, если пытаемся редактировать невидимый (напр., схлопнутый) текст
   (setq org-catch-invisible-edits 'error)
   ;; Хочу видеть дату+время, когда пункт был закрыт (CLOSED)
   (setq org-log-done 'time)
   ;; Задаем виды статусов для задач
   (setq org-todo-keywords
       '((sequence "TODO(t)" "WAIT(w)" "VERIFY(v)" "DELEGATED(D@)" "|" "DONE(d)" "CANCELED(c@)")))
   ;; Спрятать лог изменения статусов в LOGGER
   (setq org-log-into-drawer t)
   ;; Разшить refile в мои org-файлы, в поддеревья до глубины 2
   (setq org-refile-targets '((org-agenda-files :maxlevel . 2)))
   ;; При refile показывать также имя файла
   (setq org-refile-use-outline-path 'file)
   ;; Люблю выделять по shift-стрелочки, даже в org-mode
   (setq org-support-shift-select t)

   ;; Угадывать mode SRC-блоков по названию режимов
   (add-to-list 'org-src-lang-modes '("conf" . conf))
   (add-to-list 'org-src-lang-modes '("ini" . conf))
   (add-to-list 'org-src-lang-modes '("vim" . vimrc))

   ;; Подключить эти модули
   (add-to-list 'org-modules 'org-id)
   (add-to-list 'org-modules 'org-mouse)
   (add-to-list 'org-modules 'org-attach-screenshot)

   ;; Разукрашиваем статусы
   (setq org-todo-keyword-faces
         '(("WAIT" . (:foreground "#ff8040" :weight bold))
           ("VERIFY" . (:foreground "#afaf00" :weight bold))
           ("CANCELED" . (:foreground "#006000" :weight bold))))

   ;; Подкрасить слова TODO красным в org-файлах
   (face-spec-set 'org-todo '((t :foreground "red")))

   ;; Мне не нравятся большие заголовки 1-го уровня в теме leuven
   (face-spec-set 'org-level-1 '((t :height 1.1)))

   ;; Мне не нравятся большие заголовки в #TITLE
   (face-spec-set 'org-document-title '((t :height 1.2)))
 )
 #+END_SRC

*** Подключение

 #+BEGIN_SRC emacs-lisp
 (require 'org-protocol)

 (use-package
   org
   :ensure nil
   :hook ((org-mode . turn-on-flyspell)
		  ;; автоматом считывать изменения с диска
		  (org-mode . turn-on-auto-revert-mode)
		  ;; автосохранение для org-буферов
		  (auto-save . org-save-all-org-buffers)
		  ;; автоперенос строк по умолчанию
		  (org-mode . auto-fill-mode))
   :bind (:map my-bindings-map
               ("C-c l" . org-store-link))
   :config
   (my-org-mode-basic-config))
 #+END_SRC

** Org agenda

