settings.el

(setq my-org-last-reload (current-time))

(defun my-org-reload-from-disk (&optional event)
  (interactive)
  ;; релоадить не чаще раза в 3 секунды
  (if (time-less-p (time-add my-org-last-reload 3) (current-time))
	  (progn
		(setq my-org-last-reload (current-time))
		(ignore-errors
		  (org-agenda-redo-all)))))

(defvar my-org-root-path "~/org" "Path to root directory with org files")
(defvar my-org-files-regexp "[.]org$" "Regexp to match org files")

(defun my-org-fill-files-list (&optional EXHAUSTIVE)
  (setq org-agenda-files
        (seq-remove
         (lambda (file) (string-match "[.]#" file))
         (directory-files-recursively my-org-root-path my-org-files-regexp)))
  ;; после пересоздания списков файлов, неплохо бы перечитать их с диска
  (my-org-reload-from-disk))
  ;; (my-org-fill-inotify-handlers))

(defun my-org-agenda-redo ()
  (ignore-errors
    (with-current-buffer "*Org Agenda*"
      (org-agenda-maybe-redo))))

(defun my-agenda-mode-setup ()
  (hl-line-mode))

(defun my-org-agenda-basic-config ()
  ;; Дни рожденния в BBDB брать из поля birthday
  (setq org-bbdb-anniversary-field 'birthday)
  ;; Не показывать DONE в агенде
  (setq org-agenda-skip-scheduled-if-done 't)

  ;; Настройки по умолчанию в теме leuven мне в этом месте не нравятся
  (face-spec-set 'org-agenda-structure '((t :height 1.17)))
  (face-spec-set 'org-agenda-date-today '((t :height 1.1)))
  (face-spec-set 'org-agenda-date-weekend '((t :height 1.1))))

(defun my-agenda-delayed-tasks-setup ()
  (defun my-org-agenda-delay-task ()
    (interactive)
    (org-agenda-check-no-diary)
    (let* ((hdmarker (or (org-get-at-bol 'org-hd-marker)
                         (org-agenda-error)))
           (buffer (marker-buffer hdmarker))
           (pos (marker-position hdmarker))
           (inhibit-read-only t)
           newhead)
      (org-with-remote-undo buffer
        (with-current-buffer buffer
          (widen)
          (goto-char pos)
          (org-show-context 'agenda)
          (let ((delay (org-read-date 't 'nil 'nil "Отложить до" 'nil
                                      (format-time-string "%H:%M" (time-add (current-time) 3600)))))
            (org-set-property "DELAYED_TILL" delay))))
      (org-agenda-redo-all)))
  (defun my-org-agenda-delay-task-setup-hook ()
    (local-set-key (kbd "\C-c d") 'my-org-agenda-delay-task))
  (add-hook 'org-agenda-mode-hook 'my-org-agenda-delay-task-setup-hook)
)

(defun my-org-agenda-skip-delayed ()
  (let ((now (format-time-string "%Y-%m-%d %H:%M" (time-add (current-time) 120)))
        (delayed-till (org-read-date t nil (or (org-entry-get nil "DELAYED_TILL") "") nil))
        (subtree-end (save-excursion (org-end-of-subtree t))))
      (if (string> delayed-till now) subtree-end nil)))

(defun my-org-agenda-commands-config ()
  (setq org-agenda-custom-commands
      '(("d" . "Сегодня")
        ("dd" agenda "Сегодня, все записи"
         ((org-agenda-span 'day)
          (org-agenda-overriding-header "Сегодня, все записи")))
        ("da" agenda "Сегодня, без отложенных"
         ((org-agenda-span 'day)
          (org-agenda-skip-function 'my-org-agenda-skip-delayed)
          (org-agenda-overriding-header "Сегодня, только активные"))))))

(use-package
    org-agenda
    :ensure nil
    :after (org org-element)
	:hook (org-agenda-mode . my-agenda-mode-setup)
	:bind (:map my-bindings-map
				("C-c a" . org-agenda))
	:config
	(my-org-agenda-basic-config)
	(my-agenda-delayed-tasks-setup)
	(my-org-agenda-commands-config)
	(my-org-fill-files-list)
	;; раз в 10 минут заново составлять список файлов, на случай появления новых
	(run-with-timer 0 600 'my-org-fill-files-list)
	;; 
	(run-with-idle-timer 5 10 'my-org-agenda-redo)
	(my-load-org-config "local/org-agenda.org"))

(advice-add 'org-agenda-quit :before 'org-save-all-org-buffers)

(defun my-org-archive-done-tasks ()
  "Archive all DONE tasks in current buffer"
  (interactive)
  (org-map-entries
   (lambda ()
     (org-archive-subtree)
     (setq org-map-continue-from (outline-previous-heading)))
   "/DONE" 'file))

(defun my-org-clone-to-date ()
  "Clone current subtree into specified file with all dates shifted to the same period."
  (interactive)
  (let* ((title (nth 4 (org-heading-components)))
         (orig-date (org-time-string-to-absolute (org-entry-get nil "SCHEDULED")))
         (dest-date (org-time-string-to-absolute
                     (org-read-date nil nil nil (format "Дата для '%s'" title))))
         (offset (format "+%id" (- dest-date orig-date))))
    (org-copy-subtree)
    (with-temp-buffer
      (org-mode)
      (org-paste-subtree)
      (org-clone-subtree-with-time-shift 1 offset)
      (org-forward-element)
      (org-refile))))

(use-package
  org
  :defer t
  :config
  ;; Какие \usepackage прописывать в LaTeX по умолчанию
  (setq org-latex-default-packages-alist
        '(("utf8" "inputenc" t ("pdflatex"))
          ("T2A" "fontenc" t ("pdflatex"))
          ("russian" "babel" t)
          ("" "cmap" t)
          ("" "graphicx" t)
          ("" "grffile" t)
          ("" "longtable" nil)
          ("" "wrapfig" nil)
          ("" "rotating" nil)
          ("normalem" "ulem" t)
          ("" "amsmath" t)
          ("" "textcomp" t)
          ("" "tabularx" t)
          ("" "amssymb" t)
          ("" "capt-of" nil)
          ("" "hyperref" nil)))
  ;; Файлы с этими расширениями считаются временными при экспорте и будут удалены
  (setq org-latex-logfiles-extensions
        '("aux" "bcf" "blg" "fdb_latexmk" "fls" "figlist" "idx" "log" "nav" "out" "ptc" "run.xml" "snm" "toc" "vrb" "xdv" "tex")))

(use-package
  ox-hugo
  :after (ox org)
  :hook ((org-export-before-processing . my-org-hugo-add-printable-version)
         (org-export-before-processing . my-org-hugo-add-source-of-article))
  :config
  (setq org-hugo-external-file-extensions-allowed-for-copying
        '("jpg" "jpeg" "tiff" "png" "svg" "gif" "pdf" "odt" "doc" "ppt" "xls" "docx" "pptx" "xlsx" "sorg"))
  (remove-hook 'org-export-before-parsing-hook 'my-org-hugo-add-printable-version))
