settings.org
**** Экспорт embedded видео в Hugo. Не спрашивайте.

 #+BEGIN_SRC emacs-lisp
 (defun org-image-update-overlay (file link &optional data-p refresh)
   "Create image overlay for FILE associtated with org-element LINK.
         If DATA-P is non-nil FILE is not a file name but a string with the image data.
         See also `create-image'.
         This function is almost a duplicate of a part of `org-display-inline-images'."
   (when (or data-p (file-exists-p file))
     (let ((width
            ;; Apply `org-image-actual-width' specifications.
            (cond
             ((not (image-type-available-p 'imagemagick)) nil)
             ((eq org-image-actual-width t) nil)
             ((listp org-image-actual-width)
              (or
               ;; First try to find a width among
               ;; attributes associated to the paragraph
               ;; containing link.
               (let ((paragraph
                      (let ((e link))
                        (while (and (setq e (org-element-property
                                             :parent e))
                                    (not (eq (org-element-type e)
                                             'paragraph))))
                        e)))
                 (when paragraph
                   (save-excursion
                     (goto-char (org-element-property :begin paragraph))
                     (when
                         (re-search-forward
                          "^[ \t]*#\\+attr_.*?: +.*?:width +\\(\\S-+\\)"
                          (org-element-property
                           :post-affiliated paragraph)
                          t)
                       (string-to-number (match-string 1))))))
               ;; Otherwise, fall-back to provided number.
               (car org-image-actual-width)))
             ((numberp org-image-actual-width)
              org-image-actual-width)))
           (old (get-char-property-and-overlay
                 (org-element-property :begin link)
                 'org-image-overlay)))
       (if (and (car-safe old) refresh)
           (image-refresh (overlay-get (cdr old) 'display))
         (let ((image (create-image file
                                    (and width 'imagemagick)
                                    data-p
                                    :width width)))
           (when image
             (let* ((link
                     ;; If inline image is the description
                     ;; of another link, be sure to
                     ;; consider the latter as the one to
                     ;; apply the overlay on.
                     (let ((parent
                            (org-element-property :parent link)))
                       (if (eq (org-element-type parent) 'link)
                           parent
                         link)))
                    (ov (make-overlay
                         (org-element-property :begin link)
                         (progn
                           (goto-char
                            (org-element-property :end link))
                           (skip-chars-backward " \t")
                           (point)))))
               (overlay-put ov 'display image)
               (overlay-put ov 'face 'default)
               (overlay-put ov 'org-image-overlay t)
               (overlay-put
                ov 'modification-hooks
                (list 'org-display-inline-remove-overlay))
               (push ov org-inline-image-overlays))))))))

 ;; youtube

 (defvar yt-iframe-format
   (concat "<div class=\"yt-container\"><iframe src=\"https://www.youtube.com/embed/%s\""
           " frameborder=\"0\""
           " allowfullscreen>%s</iframe></div>"))

 (defvar yt-hugo-format "{{< youtube id=\"%s\" >}}")

 (org-link-set-parameters
  "yt"
  :follow (lambda (handle)
            (browse-url
             (concat "https://www.youtube.com/embed/"
                     handle)))
  :export (lambda (path desc backend)
            (cl-case backend
              (md (format yt-hugo-format path))
              (html (format yt-iframe-format path (or desc "")))
              (latex (format "\href{%s}{%s}"
                             path (or desc "video"))))))

 (defun org-yt-get-image (url)
   "Retrieve image from url."
   (let ((image-buf (url-retrieve-synchronously url)))
     (when image-buf
       (with-current-buffer image-buf
         (goto-char (point-min))
         (when (looking-at "HTTP/")
           (delete-region (point-min)
                          (progn (re-search-forward "\n[\n]+")
                                 (point))))
         (setq image-data (buffer-substring-no-properties (point-min) (point-max)))))))

 (defconst org-yt-video-id-regexp "[-_[:alnum:]]\\{10\\}[AEIMQUYcgkosw048]"
   "Regexp matching youtube video id's taken from `https://webapps.stackexchange.com/questions/54443/format-for-id-of-youtube-video'.")

 (defun org-yt-display-inline-images (&optional include-linked refresh beg end)
   "Like `org-display-inline-images' but for yt-links."
   (when (display-graphic-p)
     (org-with-wide-buffer
      (goto-char (or beg (point-min)))
      (let ((re (format "\\[\\[%s:\\(%s\\)\\]\\]" "yt" org-yt-video-id-regexp)))
        (while (re-search-forward re end t)
          (let ((video-id (match-string 1))
                (el (save-excursion (goto-char (match-beginning 1)) (org-element-context)))
                image-data)
            (when el
              (setq image-data 
                    (or (let ((old (get-char-property-and-overlay
                                    (org-element-property :begin el)
                                    'org-image-overlay)))
                          (and old
                               (car-safe old)
                               (overlay-get (cdr old) 'display)))
                        (org-yt-get-image (format "http://img.youtube.com/vi/%s/0.jpg" video-id))))
              (when image-data
                (org-image-update-overlay image-data el t t)))))))))

 (use-package
   org
   :ensure nil
   :config (advice-add #'org-display-inline-images :after #'org-yt-display-inline-images))
 #+END_SRC

*** Mind map

#+BEGIN_SRC emacs-lisp
(use-package org-mind-map
  :init
  (require 'ox-org)
  :ensure t
  :config
  ;; Никогда не хочу получать маленькие картинки. У меня большой мозг и он генерирует большие карты
  (setq org-mind-map-default-graph-attribs '()))
#+END_SRC

** Org babel (исполняемые кусочки кода в org-файлах)

 Org babel режимые, которые надо поддержать

 #+BEGIN_SRC emacs-lisp
 (defun my-org-confirm-babel-evaluate (lang body)
   (not (or
         (string= lang "latex")
         (string= lang "dot")
         (string= lang "graphviz")
         (string= lang "gnuplot")
         (string= lang "plantuml"))))

 (use-package
   org-babel
   :ensure nil
   :after
   (org ob-ruby ob-perl ob-shell ob-sql ob-plantuml ob-gnuplot ob-coq ob-python ob-ocaml ob-http)
   :config
   ;; Не просить подтверждение для запуска SRC-блоков
   (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
   ;; Загрузить языки
   (org-babel-do-load-languages
    'org-babel-load-languages
    '((perl . t)
      (ruby . t)
      (shell . t)
      (latex . t)
      (org . t)
      (dot . t)
      (http . t)
      (sql . t)
      (coq . t)
      (ocaml . t)
      (plantuml . t)
      (gnuplot 't)
      (emacs-lisp . t))))
 #+END_SRC

