settings.el

(defvar my-org-file-main-inbox "~/org/personal/general-TODO.org" "Главный файл для инбокса задач")
(defvar my-org-file-web-bookmarks "~/org/personal/web-bookmarks.org" "Путь до файла, где хранятся веб-закладки")

(use-package
  org-capture
  :ensure nil
  :after (org)
  :bind (:map my-bindings-map
              ("C-c c" . org-capture))
  :config
  ;; Главная кнопка добавления задачи
  (add-to-list
   'org-capture-templates
   '("g" "Общий TODO" entry (file my-org-file-main-inbox)
     "* TODO %?\nSCHEDULED: %t"))
  ;; Заметки из браузера тоже сохраняем в главный инбокс
  (add-to-list
   'org-capture-templates
   '("Pm" "(Protocol bookmark)" entry (file+headline my-org-file-main-inbox "Сохранено из браузера")
     "* TODO Взято из веба: [[%:link][%:description]]\n  SCHEDULED: %^T\n\nДобавлено: %U\n\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n%?"))
  ;; Закладки браузера храним в указанном org-файле, в дереве годов/месяцев/дат
  (add-to-list
   'org-capture-templates
   '("Pb" "(Protocol bookmark)" entry (file+olp+datetree my-org-file-web-bookmarks)
     "* Закладка %U : [[%:link][%:description]]\n%?\n"))
  ;; Подгрузить приватный локальный конфиг для конкретного хоста
  (my-load-org-config "local/org-capture.org"))

(defun my-org-clone-to-date ()
  "Clone current subtree into specified file with all dates shifted to the same period."
  (interactive)
  (let* ((title (nth 4 (org-heading-components)))
         (orig-date (org-time-string-to-absolute (org-entry-get nil "SCHEDULED")))
         (dest-date (org-time-string-to-absolute
                     (org-read-date nil nil nil (format "Дата для '%s'" title))))
         (offset (format "+%id" (- dest-date orig-date))))
    (org-copy-subtree)
    (with-temp-buffer
      (org-mode)
      (org-paste-subtree)
      (org-clone-subtree-with-time-shift 1 offset)
      (org-forward-element)
      (org-refile))))

(use-package
  org-password-manager
  :after (org)
  :hook (org-mode . org-password-manager-key-bindings))

(defun my-org-mode-on-save-buffer-setup ()
  (add-hook 'before-save-hook #'org-table-iterate-buffer-tables nil 'make-it-local))

(use-package
  org-table
  :ensure nil
  :after (org)
  :hook (org-mode . my-org-mode-on-save-buffer-setup))

(defun my-org-archive-done-tasks ()
  "Archive all DONE tasks in current buffer"
  (interactive)
  (org-map-entries
   (lambda ()
     (org-archive-subtree)
     (setq org-map-continue-from (outline-previous-heading)))
   "/DONE" 'file))

(use-package
  flyspell
;  :ensure-system-package (ispell aspell-en aspell-ru)
  :hook ((text-mode . turn-on-flyspell)
		 (prog-mode . flyspell-prog-mode))
  :commands (flyspell-buffer turn-on-flyspell)
  :config
  ;; Переключаем язык проверки по переключению раскладки
  (defadvice my-select-input-eng (after ispell-american activate) (ispell-change-dictionary "american"))
  (defadvice my-select-input-rus (after ispell-russian activate) (ispell-change-dictionary "russian"))

  ;; Проверять все буферы, включая временные типа *scratch* и буферов Gnus
  (setq flyspell-lazy-disallow-buffers nil))

(use-package
  flyspell-lazy
  :config
  (setq flyspell-lazy-idle-seconds 1)
  (flyspell-lazy-mode 1))

(use-package helm-org-rifle)

(use-package
  helm
  :after (helm-org-rifle recentf)
  :bind (:map my-bindings-map
              ("M-s M-s" . my-helm-search-all))
  :preface
  ;; Функция ищет по всем подключенным источникам
  (defun my-helm-search-all ()
	(interactive)
	(let ((sources (append (helm-org-rifle-get-sources-for-open-buffers) my-helm-sources)))
	  (unless helm-source-buffers-list
		(setq helm-source-buffers-list
			  (helm-make-source "Buffers" 'helm-source-buffers)))
	  (helm :sources sources
			:buffer "*helm completions*")))
  (defvar my-helm-sources)
  :config
  (require 'helm-for-files)
  (require 'helm-elisp)
  (setq helm-split-window-in-side-p t
        helm-M-x-fuzzy-match t
        helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match t
        helm-move-to-line-cycle-in-source t
        projectile-completion-system 'helm)
  (setq helm-input-idle-delay 0.1)
  (setq my-helm-sources
		'(helm-source-buffers-list
		  helm-source-recentf
		  helm-source-info-pages
		  helm-source-complex-command-history
		  helm-source-etags-select
		  helm-source-grep-ag
		  helm-source-bookmarks))
  (helm-adaptive-mode 1))

(use-package helm-descbinds
  :after helm
  :config
  (helm-descbinds-mode))
