settings.el

(defun my-gnus-zap-to-signature ()
  (interactive)
  (let ((curpos (point))
		(endpos (re-search-forward "\n-- " nil t 1)))
	(if (not (eq endpos nil))
		(progn
		  (kill-region curpos (match-beginning 0))
		  (goto-char curpos)
		  (open-line 1)))))

(defun my-gnus-update-news-external ()
  (interactive)
  (progn
    (message "Checking new news from external sources...")
    (shell-command "(offlineimap -o -1; notmuch new) >/dev/null 2>&1")
    (message "Checking new news from external sources... DONE")
    (gnus-group-get-new-news)))

(use-package
  gnus
  :commands (gnus)
  :hook ((message-mode . turn-on-flyspell)
		 (message-send . ispell-message)
		 (gnus-message-setup . mml-secure-message-sign-pgpmime))
  :bind (:map message-mode-map
              ("M-z" . my-gnus-zap-to-signature)
			  :map gnus-group-mode-map
			  ("M-g" . my-gnus-update-news-external))
  :config
  ;; Надо определить переменные
  (require 'gnus-msg)

  ;; Периодический полл источников
  (gnus-demon-add-handler 'gnus-demon-scan-news 1200 300)
  (gnus-demon-init)

  ;; Какой браузер использовать
  (setq gnus-button-url 'browse-url-generic
		browse-url-generic-program "chromium"
		browse-url-browser-function gnus-button-url)

  ;; По умолчанию во всех группах делать копию отправляемого письма себе
  (setq gnus-parameters
		'((".*"
		   (gcc-self . t))))

  ;; Перед сохранением аттача имеет смысл нажать [A C], чтобы вытянуть сообщение целиком
  (setq nnimap-fetch-partial-articles "text/")

  ;; Обнуляем основной источник писем
  (setq gnus-select-method '(nnnil ""))

  ;; Подключить дополнительные источники
  (setq gnus-secondary-select-methods
		;; Получение через IMAP с локалхоста
		'((nnimap "Mail"
				  (nnimap-stream shell)
				  (nnimap-shell-program "/usr/lib/dovecot/imap"))
		  ;; UNIX mailbox
		  (nnmbox "LocalMBOX")))

  ;; Подгрузить приватный локальный конфиг для конкретного хоста
  (my-load-org-config "local/gnus-accounts.org")

  ;; Подгрузить шаблоны писем
  (my-load-org-config "local/gnus-templates.org")

  ;; Способ оформления цитаты
  (setq message-citation-line-function 'message-insert-formatted-citation-line)

  ;; Отправленные сообщения метить прочитанными (TODO работает ли?)
  (setq gnus-gcc-mark-as-read t)

  ;; Архивировать будем в IMAP
  (setq gnus-message-archive-method
		'(nnimap "Mail"
				 (nnimap-stream shell)
				 (nnimap-shell-program "/usr/lib/dovecot/imap"))
		;; ... в папку sent
		gnus-message-archive-group "sent")

  ;; В наши трудные времена надо хотя бы сделать вид, что ты обеспечиваешь безопасность переписки
  (setq mml2015-use 'epg
		;; немного дебага
		mml2015-verbose t
		;; шифровать и для себя
		mml-secure-openpgp-encrypt-to-self t
		;; проверять подпись и у зашифрованных сообщений(?)
		mml-secure-openpgp-always-trust nil
		;; кэшировать пароль от хранилища ключей
		mml-secure-cache-passphrase t
		;; кэшировать пароль от хранилища на 10 часов
		mml-secure-passphrase-cache-expiry '36000
		;; определять используемый ключ при подписи по адресу отправителя
		mml-secure-openpgp-sign-with-sender t
		;; всегда спрашивать, надо ли расшифровать зашифрованный парт письма
		mm-decrypt-option nil
		;; всегда проверять достоверность подписанного парта
		mm-verify-option 'always)

  ;; зашифрованные парты и подписи надо показывать кнопкой
  (add-to-list 'gnus-buttonized-mime-types "multipart/signed")
  (add-to-list 'gnus-buttonized-mime-types "multipart/encrypted")

  ;; Наводим красоты
  (setq gnus-group-line-format "%M%S%5y%6t: %(%g%)\n"
		gnus-summary-line-format "%U%R %B %[%-23,23a%] %s\n")

  (when window-system
	(setq gnus-sum-thread-tree-indent "  "
		  gnus-sum-thread-tree-root "● "
		  gnus-sum-thread-tree-false-root "◯ "
		  gnus-sum-thread-tree-single-indent "◎ "
		  gnus-sum-thread-tree-vertical        "│"
		  gnus-sum-thread-tree-leaf-with-other "├─► "
		  gnus-sum-thread-tree-single-leaf     "╰─► "))
  )

(add-hook 'dired-mode-hook 'auto-revert-mode)

(defun sport/equipment-report-weights (src)
  "Return summary weights grouped by buggage type"
  (let
      ((vals
        (let ((cols (- (length (first src)) 2)))
                (seq-reduce '(lambda (sums row)
                               (mapcar*
                                '(lambda (v s)
                                   (+ (* (number-or-v v 0) (lst-number-or-v row 1 0)) s))
                                (nthcdr 2 row)
                                sums))
                            (cdr src)
                            (make-list cols 0)))))
    (list
     (cons "ИТОГО" (nthcdr 2 (first src)))
     'hline
     (cons (seq-reduce #'+ vals 0) vals))))

(defun sport/equipment-report-baggage (src pos)
  "Return list for specified buggage type (column position in src table)"
  (cons
   '("" "Вес" "Кол-во")
   (cons
    'hline
    (sort 
     (remove-if-not
      '(lambda (row) (> (nth 1 row) 0))
      (map
       #'list
       '(lambda (row)
          (let ((name (first row))
                (cnt (lst-number-or-v row pos 0)))
            (list name (* (lst-number-or-v row 1 0) cnt) cnt)))
       (cdr src)))
     (lambda (a b) (> (nth 1 a) (nth 1 b)))))))

(defun sport/equipment-report-shared (src)
  "Return list for specified buggage type (column position in src table)"
  (cons
   '("" "Вес" "Кол-во")
   (cons
    'hline
    (sort 
      (map
       #'list
       '(lambda (row)
          (list
           (first row)
           (lst-number-or-v row 1 0)
           (lst-number-or-v row 6 0)))
       (remove-if
        '(lambda (row) (= (lst-number-or-v row 6 0) 0))
        (cdr src)))
      (lambda (a b) (string< (nth 0 a) (nth 0 b)))))))

(defun my-sport-journal-add (type value notes)
  (interactive
   (list
    (completing-read
     "Тип: "
     (with-current-buffer (find-file-noselect "~/org/personal/sport/sports-periodic-TODO.org")
       (outline-show-all)
       (goto-char (point-min))
       (setq case-fold-search nil)
       (re-search-forward "^#\\+NAME: sports-journal")
       (next-line)
       (mapcar
        (lambda (row) (car (cdr row)))
        (seq-filter (lambda (row) (not (eq row 'hline))) (org-table-to-lisp)))))
    (read-string "Значение: ")
    (read-string "Заметки: ")))
  ;; TODO: improve
  (with-current-buffer (find-file-noselect "~/org/personal/sport/sports-periodic-TODO.org")
    (goto-char (point-min))
    (setq case-fold-search nil)
    (re-search-forward "^#\\+NAME: sports-journal")
    (next-line)
    (goto-char (org-table-end))
    (insert
     (format "| [%s] | %s | | %s | %s |\n" (format-time-string "%F %R") type value notes))))

(use-package
  calendar
  :ensure nil
  :config
