settings.org
*** Календарь

 #+BEGIN_SRC emacs-lisp
 (use-package
   calendar
   :ensure nil
   :config
   (setq calendar-location-name "Moscow"
         calendar-latitude 55.5
         calendar-longitude 37.4)
   ;; Хочу русский календарь!
   (setq calendar-week-start-day 1
		 calendar-day-abbrev-array ["Вс" "Пн" "Вт" "Ср" "Чт" "Пт" "Сб"]
		 calendar-day-header-array calendar-day-abbrev-array
		 calendar-day-name-array ["Воскресенье" "Понедельник" "Вторник" "Среда" "Четверг" "Пятница" "Суббота"]
		 calendar-month-name-array ["Январь" "Февраль" "Март" "Апрель" "Май" 
								    "Июнь" "Июль" "Август" "Сентябрь"
								    "Октябрь" "Ноябрь" "Декабрь"]))
 #+END_SRC

 Русские праздники:

 #+BEGIN_SRC emacs-lisp
 (use-package
   russian-holidays
   :after (calendar)
   :config
   (setq calendar-holidays russian-holidays))

 #+END_SRC


*** Финансы

#+BEGIN_SRC emacs-lisp
(use-package
  org-expenses
  :load-path "~/.emacs.d/public/org-expenses"
  :bind (:map my-bindings-map
              ("C-c f" . org-expenses/expense-view))
  :config
  (setq org-expenses/files "~/org/personal"))
#+END_SRC


*** Вспомогательные функции

#+BEGIN_SRC emacs-lisp
(defun number-or-v (n v)
  "Return V if N is not a number, or N otherwise."
  (if (not (numberp n)) v n))

(defun lst-number-or-v (lst pos v)
  "Return V if list element at POS is not a number, or (nth POS LST) otherwise."
  (number-or-v (nth pos lst) v))
#+END_SRC
