settings.el
  (setq calendar-location-name "Moscow"
        calendar-latitude 55.5
        calendar-longitude 37.4)
  ;; Хочу русский календарь!
  (setq calendar-week-start-day 1
		calendar-day-abbrev-array ["Вс" "Пн" "Вт" "Ср" "Чт" "Пт" "Сб"]
		calendar-day-header-array calendar-day-abbrev-array
		calendar-day-name-array ["Воскресенье" "Понедельник" "Вторник" "Среда" "Четверг" "Пятница" "Суббота"]
		calendar-month-name-array ["Январь" "Февраль" "Март" "Апрель" "Май" 
								   "Июнь" "Июль" "Август" "Сентябрь"
								   "Октябрь" "Ноябрь" "Декабрь"]))

(use-package
  russian-holidays
  :after (calendar)
  :config
  (setq calendar-holidays russian-holidays))
